[
    {
        "name": "Jujutsu Kaisen, Vol. 22",
        "author": [
            "Gege Akutami"
        ],
        "popularity rank": 1,
        "genres": [
            "media tie in",
            "horror",
            "fantasy",
            "general",
            "manga",
            "media tie-in"
        ],
        "description": "<b>To gain the power he needs to save his friend from a cursed spirit, Yuji Itadori swallows a piece of a demon, only to find himself caught in the midst of a horrific war of the supernatural!</b> <p/>In a world where cursed spirits feed on unsuspecting humans, fragments of the legendary and feared demon Ryomen Sukuna have been lost and scattered about. Should any demon consume Sukuna's body parts, the power they gain could destroy the world as we know it. Fortunately, there exists a mysterious school of jujutsu sorcerers who exist to protect the precarious existence of the living from the supernatural! <p/>A mysterious cursed spirit with a grudge against Maki flies into Sakurajima Colony. It evolves with incredible speed from cursed womb to adult form and threatens to overwhelm Maki and Noritoshi. Just then, two more combatants join the battle...",
        "rating": null
    },
    {
        "name": "The Women",
        "author": [
            "Kristin Hannah"
        ],
        "popularity rank": 2,
        "genres": [
            "general",
            "family life",
            "women"
        ],
        "description": "<p><b>The missing. The forgotten. The brave... The women. <p/>From master storyteller Kristin Hannah, #1 New York Times bestselling author of The Nightingale and The Four Winds, comes the story of a turbulent, transformative era in America: the 1960s. The Women is that rarest of novels--at once an intimate portrait of a woman coming of age in a dangerous time and an epic tale of a nation divided by war and broken by politics, of a generation both fueled by dreams and lost on the battlefield. </b> <p/>\"Women can be heroes, too.\" <p/>When twenty-year-old nursing student Frances \"Frankie\" McGrath hears these unexpected words, it is a revelation. Raised on idyllic Coronado Island and sheltered by her conservative parents, she has always prided herself on doing the right thing, being a good girl. But in 1965 the world is changing, and she suddenly imagines a different choice for her life. When her brother ships out to serve in Vietnam, she impulsively joins the Army Nurse Corps and follows his path. <p/>As green and inexperienced as the men sent to Vietnam to fight, Frankie is overwhelmed by the chaos and destruction of war, as well as the unexpected trauma of coming home to a changed and politically divided America. <p/>The Women is the story of one woman gone to war, but it shines a light on the story of all women who put themselves in harm's way to help others. Women whose sacrifice and commitment to their country has all too often been forgotten. A novel of searing insight and lyric beauty, The Women is a profoundly emotional, richly drawn story with a memorable heroine whose extraordinary idealism and courage under fire define a generation.</p>",
        "rating": 8.857142
    },
    {
        "name": "Dog Man: The Scarlet Shedder: A Graphic Novel (Dog Man #12): From the Creator of Captain Underpants",
        "author": [
            "Dav Pilkey"
        ],
        "popularity rank": 3,
        "genres": [
            "humorous",
            "superheroes",
            "comics & graphic novels",
            "action & adventure",
            "animals",
            "general",
            "humorous stories",
            "dogs"
        ],
        "description": "<b>Our canine superhero returns in DOG MAN: THE SCARLET SHEDDER, the suspenseful and hilarious twelfth graphic novel in the #1 worldwide bestselling series by award-winning author and illustrator Dav Pilkey!</b><p></p><p>P.U.! Dog Man got sprayed by a skunk! After being dunked in tomato juice, the stink is gone but the scarlet red color remains. Now exiled, this spunky superhero must struggle to save the citizens who shunned him! Will the ends justify the means for Petey, who's reluctantly pulled back into a life of crime in order to help Dog Man? And who will step forward when an all-new, never-before-seen villain unleashes an army of A.I. robots?</p><p>The fun and creativity continue with <b>Dog Man with Love: The Official Coloring Book.</b> And for more heartfelt graphic novel adventures, join Flippy and Li'l Petey in the <b>Cat Kid Comic Club</b> series. And don't forget the series that started it all: <b>Captain Underpants!</b></p>",
        "rating": null
    },
    {
        "name": "A Calamity of Souls",
        "author": [
            "David Baldacci"
        ],
        "popularity rank": 4,
        "genres": [
            "crime",
            "mystery & detective",
            "police procedural",
            "action & adventure",
            "thrillers",
            "suspense"
        ],
        "description": "<b>Set in the tumultuous year of 1968 in southern Virginia, a racially-charged murder case sets a duo of white and Black lawyers against a deeply unfair system as they work to defend their wrongfully-accused Black defendants in this courtroom drama from #1 <i>New York Times</i> bestselling author David Baldacci. <br> </b> <br> Jack Lee is a white lawyer from Freeman County, Virginia, who has never done anything to push back against racism, until he decides to represent Jerome Washington, a Black man charged with brutally killing an elderly and wealthy white couple. Doubting his decision, Lee fears that his legal skills may not be enough to prevail in a case where the odds are already stacked against both him and his client. And he quickly finds himself out of his depth when he realizes that what is at stake is far greater than the outcome of a murder trial. <br> <br> Desiree DuBose is a Black lawyer from Chicago who has devoted her life to furthering the causes of justice and equality for everyone. She comes to Freeman County and enters a fractious and unwieldy partnership with Lee in a legal battle against the best prosecutor in the Commonwealth. Yet DuBose is also aware that powerful outside forces are at work to blunt the victories achieved by the Civil Rights era. <br> <br> Lee and DuBose could not be more dissimilar. On their own, neither one can stop the prosecution's deliberate march towards a guilty verdict and the electric chair. But together, the pair fight for what once seemed impossible: a chance for a fair trial and true justice. <p/> Over a decade in the writing, <i>A Calamity of Souls</i> breathes richly imagined and detailed life into a bygone era, taking the reader through a world that will seem both foreign and familiar.",
        "rating": null
    },
    {
        "name": "An Unfinished Love Story: A Personal History of the 1960s",
        "author": [
            "Doris Kearns Goodwin"
        ],
        "popularity rank": 5,
        "genres": [
            "united states",
            "20th century",
            "personal memoirs",
            "presidents & heads of state"
        ],
        "description": "<b><i>An Unfinished Love Story: A Personal History of the 1960s</i></b><b> by Doris Kearns Goodwin, one of America's most beloved historians, artfully weaves together biography, memoir, and history. She takes you along on the emotional journey she and her husband, Richard (Dick) Goodwin embarked upon in the last years of his life.</b> <p/>Dick and Doris Goodwin were married for forty-two years and married to American history even longer. In his twenties, Dick was one of the brilliant young men of John F. Kennedy's New Frontier. In his thirties he both named and helped design Lyndon Johnson's Great Society and was a speechwriter and close advisor to Robert Kennedy. Doris Kearns was a twenty-four-year-old graduate student when selected as a White House Fellow. She worked directly for Lyndon Johnson and later assisted on his memoir. <p/>Over the years, with humor, anger, frustration, and in the end, a growing understanding, Dick and Doris had argued over the achievements and failings of the leaders they served and observed, debating the progress and unfinished promises of the country they both loved. <p/>The Goodwins' last great adventure involved finally opening the more than three hundred boxes of letters, diaries, documents, and memorabilia that Dick had saved for more than fifty years. They soon realized they had before them an unparalleled personal time capsule of the 1960s, illuminating public and private moments of a decade when individuals were powered by the conviction they could make a difference; a time, like today, marked by struggles for racial and economic justice, a time when lines were drawn and loyalties tested. <p/>Their expedition gave Dick's last years renewed purpose and determination. It gave Doris the opportunity to connect and reconnect with participants and witnesses of pivotal moments of the 1960s. And it gave them both an opportunity to make fresh assessments of the central figures of the time--John F. Kennedy, Jacqueline Kennedy, Martin Luther King Jr., Robert Kennedy, Eugene McCarthy, and especially Lyndon Johnson, who greatly impacted both their lives. The voyage of remembrance brought unexpected discoveries, forgiveness, and the renewal of old dreams, reviving the hope that the youth of today will carry forward this unfinished love story with America.",
        "rating": null
    },
    {
        "name": "The Anxious Generation: How the Great Rewiring of Childhood Is Causing an Epidemic of Mental Illness",
        "author": [
            "Jonathan Haidt"
        ],
        "popularity rank": 6,
        "genres": [
            "life stages",
            "self-management",
            "teenagers",
            "mental health",
            "stress management"
        ],
        "description": "<b>From <i>New York Times </i>bestselling coauthor of <i>The Coddling of the American Mind</i>, <i> </i>an essential investigation into the collapse of youth mental health--and a plan for a healthier, freer childhood</b> <p/>After more than a decade of stability or improvement, the mental health of adolescents plunged in the early 2010s. Rates of depression, anxiety, self-harm, and suicide rose sharply, more than doubling on most measures. Why? <p/>In <i>The Anxious Generation</i>, social psychologist Jonathan Haidt lays out the facts about the epidemic of teen mental illness that hit many countries at the same time. He then investigates the nature of childhood, including why children need play and independent exploration to mature into competent, thriving adults. Haidt shows how the \"play-based childhood\" began to decline in the 1980s, and how it was finally wiped out by the arrival of the \"phone-based childhood\" in the early 2010s. He presents more than a dozen mechanisms by which this \"great rewiring of childhood\" has interfered with children's social and neurological development, covering everything from sleep deprivation to attention fragmentation, addiction, loneliness, social contagion, social comparison, and perfectionism. He explains why social media damages girls more than boys and why boys have been withdrawing from the real world into the virtual world, with disastrous consequences for themselves, their families, and their societies. <p/>Most important, Haidt issues a clear call to action. He diagnoses the \"collective action problems\" that trap us, and then proposes four simple rules that might set us free. He describes steps that parents, teachers, schools, tech companies, and governments can take to end the epidemic of mental illness and restore a more humane childhood. <p/>Haidt has spent his career speaking truth backed by data in the most difficult landscapes--communities polarized by politics and religion, campuses battling culture wars, and now the public health emergency faced by Gen Z. We cannot afford to ignore his findings about protecting our children--and ourselves--from the psychological damage of a phone-based life.",
        "rating": null
    },
    {
        "name": "The Familiar",
        "author": [
            "Leigh Bardugo"
        ],
        "popularity rank": 7,
        "genres": [
            "renaissance",
            "magical realism",
            "historical",
            "fantasy",
            "general"
        ],
        "description": "<p><b>From the #1 <i>New York Times </i>bestselling author Leigh Bardugo comes a spellbinding novel set in the Spanish Golden Age.<br></b><br>In a shabby house, on a shabby street, in the new capital of Madrid, Luzia Cotado uses scraps of magic to get through her days of endless toil as a scullion. But when her scheming mistress discovers the lump of a servant cowering in the kitchen is actually hiding a talent for little miracles, she demands Luzia use those gifts to improve the family's social position. <p/>What begins as simple amusement for the nobility takes a perilous turn when Luzia garners the notice of Antonio Pérez, the disgraced secretary to Spain's king. Still reeling from the defeat of his armada, the king is desperate for any advantage in the war against England's heretic queen--and Pérez will stop at nothing to regain the king's favor. <p/>Determined to seize this one chance to better her fortunes, Luzia plunges into a world of seers and alchemists, holy men and hucksters, where the lines between magic, science, and fraud are never certain. But as her notoriety grows, so does the danger that her Jewish blood will doom her to the Inquisition's wrath. She will have to use every bit of her wit and will to survive--even if that means enlisting the help of Guillén Santángel, an embittered immortal familiar whose own secrets could prove deadly for them both.</p>",
        "rating": null
    },
    {
        "name": "Seriously, So Good: Simple Recipes for a Balanced Life (a Cookbook)",
        "author": [
            "Carissa Stanton"
        ],
        "popularity rank": 8,
        "genres": [
            "health & healing",
            "methods",
            "quick & easy",
            "general",
            "entertaining"
        ],
        "description": "<b>Delicious, satisfying recipes that are good for your health, heart, and mind by the beloved blogger and creator of <i>Brocc Your Body</i>.</b> <p/>Self-proclaimed SoCal beach girl Carissa Stanton first earned her nickname Brocc, not because of an obsession with broccoli (though she thinks it's a damn good veggie), but because she hosted weekly girl's nights with her friends who loved to cook, eat--and move their bodies. With Justin Timberlake's \"Rock Your Body\" in mind, she combined her love of food and created @BroccYourBody to start sharing her favorite recipes on Instagram. <p/> Now, Carissa shares with her hundreds of thousands of followers how cooking for yourself after a busy day of work can be just as exciting as relaxing with friends over cocktails and apps. <i>Seriously, So Good</i> reflects her philosophy of feeling good about what she's cooking and eating by making smart choices without depriving herself of carbs or a splash of cream here and there. She wants to remove the anxiety around food by helping us all feel more confident in and out of the kitchen. She shares her recipes and balanced outlook to motivate others to experience a stress-free cooking approach while enjoying mouth-watering meals alone or with loved ones. <p/> The 100 flavor-bomb dishes, which are approachable, nourishing, and always fun, include all-time favorites such as her viral Greek-Style Lemon Chicken Soup, a better-for-you take on fast food with her \"Fried\" Chicken Sandwich with Special Sauce, and more like: <p/> <ul> <li>Pan-Fried Brie with Pistachios and Rosemary Hot Honey</li> <li>Sun-Dried Tomato and Feta Turkey Burgers with Jalapeño Tzatziki</li> <li>Brown Butter Lemon Halibut with Asparagus and Olive Oil Whipped Potatoes</li> <li>Chicken Pot Pie Soup with Flaky Biscuits</li> <li>Spicy Rosé Spritz</li> <li>Flourless Espresso Brownies</li> </ul> <br>Carissa describes her recipes as healthy, but not too healthy because health isn't just about being able to run a marathon or eating \"clean.\" It's about living your life to the fullest.",
        "rating": null
    },
    {
        "name": "Taming 7",
        "author": [
            "Chloe Walsh"
        ],
        "popularity rank": 9,
        "genres": [
            "social themes",
            "dating & sex",
            "contemporary",
            "general",
            "romance",
            "sports & recreation"
        ],
        "description": "<p>*FIRST PRINT RUN LIMITED EDITION OMBRE SPINE DESIGN - ONLY WHILE SUPPLIES LAST*</p><p><strong><em>Taming 7</em> is an epic and unforgettable love story in the international bestselling and TikTok-phenomenon The Boys of Tommen series, from Chloe Walsh.</strong></p><p><strong>She's the quintessential sunshine girl. He's the lovable class clown. But storm clouds are rolling in, and this Tommen boy is about to get serious.</strong></p><p>Tommen's cheekiest lad, Gerard 'Gibsie' Gibson, has always been a comedian, but most people don't see what lurks beneath the surface. He is haunted by events of the past and he uses humor to cope, hiding his true self from the world.</p><p>Claire Biggs, the epitome of sunshine, has always loved Gibsie, her brother's friend and her favorite neighbor. She has always seen a side to him that no one else seems to notice. She becomes determined to tame her wild-at-heart childhood best friend.</p><p>When lines are crossed, it becomes unclear whether Gibsie and Claire's friendship will survive. Will it blossom into something more, or will they lose themselves in the wild?</p><p>Following characters that readers have grown to adore, <em>Taming 7</em> will only expand your love for the Boys of Tommen universe. This book is perfect for readers looking for: </p><ul><li>New adult/YA crossover Irish romance</li><li>Dual POVs</li><li>Friends-to-lovers</li><li>Angsty tearjerkers</li><li>Bingeworthy TikTok books</li>",
        "rating": null
    },
    {
        "name": "Table for Two: Fictions",
        "author": [
            "Amor Towles"
        ],
        "popularity rank": 10,
        "genres": [
            "short stories (single author)",
            "literary",
            "historical",
            "20th century",
            "general"
        ],
        "description": "<b><b>Named a Most Anticipated Book of 2024 by the <i>New York Times Book Review </i>Podcast, <i> Reader's Digest</i>, <i>TIME Magazine</i>, and more</b> <p/>From the bestselling author of <i>The Lincoln Highway</i>, <i>A Gentleman in Moscow</i>, and <i>Rules of Civility</i>, a richly detailed and sharply drawn collection of stories, including a novella featuring one of his most beloved characters</b> <p/> Millions of Amor Towles fans are in for a treat as he shares some of his shorter fiction: six stories based in New York City and a novella set in Golden Age Hollywood. <p/> The New York stories, most of which take place around the year 2000, consider the fateful consequences that can spring from brief encounters and the delicate mechanics of compromise that operate at the heart of modern marriages. <p/> In Towles's novel <i>Rules of Civility</i>, the indomitable Evelyn Ross leaves New York City in September 1938 with the intention of returning home to Indiana. But as her train pulls into Chicago, where her parents are waiting, she instead extends her ticket to Los Angeles. Told from seven points of view, \"Eve in Hollywood\" describes how Eve crafts a new future for herself--and others--in a noirish tale that takes us through the movie sets, bungalows, and dive bars of Los Angeles. <p/> Written with his signature wit, humor, and sophistication, <i>Table for Two </i>is another glittering addition to Towles's canon of stylish and transporting fiction.",
        "rating": null
    },
    {
        "name": "Red Helicopter--A Parable for Our Times: Lead Change with Kindness (Plus a Little Math)",
        "author": [
            "James Rhee"
        ],
        "popularity rank": 11,
        "genres": [
            "leadership",
            "ethics & moral philosophy",
            "personal success",
            "workplace culture",
            "motivational & inspirational",
            "cultural, ethnic & regional",
            "buddhist",
            "business ethics",
            "personal growth",
            "success",
            "asian & asian american",
            "inspiration & personal growth",
            "business"
        ],
        "description": "<p><strong>Embrace your agency, lead change, and fly free--in the business of life <em>and</em> the life of business--with kindness (plus a little math)</strong></p><p>In kindergarten, James Rhee received a toy red helicopter in gratitude for a simple act of generosity--sharing his lunch. Decades later, the lesson from that small gift led him to develop a human-centered framework for business and personal achievement that helped him overcome seemingly insurmountable hurdles and find unprecedented success.</p><p><strong>\"<em>red helicopter</em> is</strong> <strong>a transformative experience</strong>. James Rhee's story <strong>is a must read</strong> for anyone, of any age, who wishes to think, act, and <strong>lead with balance, agility, and wisdom</strong>.\" --Jay Shetty</p><p>Rhee was a high school teacher turned private equity investor when he unexpectedly took the helm of Ashley Stewart, an iconic company predominantly employing and serving Black women. Inspired by the values his dying Korean immigrant parents instilled in him, he knew that a radically different--yet familiar--approach was required to lead this twice-bankrupt company from certain liquidation to true transcendence.</p><p><strong>Is it possible to be successful <em>and</em> kind? To lead with precision <em>and</em> compassion? To honor who we are in <em>all</em> areas of our lives?</strong></p><p>The entire world bet against him and Ashley, but Rhee trusted his instincts to identify, measure, and leverage the intangible goodwill at the company's core, a decision which ultimately multiplied its fortunes several times over.</p><p><strong>Anyone can combine the clarity and imagination we had as children with fundamental business metrics. Anyone can apply this refreshingly intuitive approach to lead change at work <em>and</em> at home. </strong></p><p>While eloquently sharing a story of personal and professional success, <em>red helicopter </em>presents a comforting yet bold solution to the dissatisfaction and worry we all feel in a chaotic and sometimes terrifying world.</p><p><strong>The insights and knowledge that Rhee imparts have been accumulated over decades of investing and leading at the highest levels of business.</strong> Drawing on this experience, he encourages us to trust the wisdom deep inside each of us so we can learn how to: </p><ul>Create and measure \"goodwill,\" the ultimate collective good</li>Discover agency and the truth about kindness it entails</li>Identify the invisible obstacles standing in your way</li>Lead transformational change through small, scalable acts</li>Construct an accurate \"balance sheet\" of our assets and liabilities</li>Reorient our lives, organizations, and the world to reflect the best in us</li></ul><p><strong>Are you looking for a sustainable balance between life, money, and joy? For yourself and others?</strong></p><p>Imagine, a clear path forward told as a deeply felt human story. A poignant and uplifting celebration of humanity, <em>red helicopter--a parable for our times </em>is a tale of struggle and triumph, compelling for its honesty and relatability as much as for the instructions we can all use to balance the books of our lives.</p><p><em>red helicopter--a parable for our times</em> features approximately 20 original illustrations by Korean artist Heyon Cho.</p>",
        "rating": null
    },
    {
        "name": "Financial Literacy for All: Disrupting Struggle, Advancing Financial Freedom, and Building a New American Middle Class",
        "author": [
            "John Hope Bryant"
        ],
        "popularity rank": 12,
        "genres": [
            "general",
            "finance",
            "budgeting",
            "economics"
        ],
        "description": "<p><b>A new approach to understanding money and achieving financial fulfillment</b></p> <p>Former Vice-Chairman of the U.S. President's Advisory Council on Financial Literacy, John Hope Bryant, delivers an accessible and powerful resource for everyday Americans seeking to build a strong financial foundation. This book is an easy-to-read first step toward a fulfilling financial future, helping you understand your relationship to work and money, and a key component to untangling the surprisingly simple puzzle of personal finance.</p> <p>With an insightful foreword by Doug McMillon, President and CEO of Walmart Inc., you'll learn how to create wealth for yourself and your family, regardless of your educational or employment background, and how to establish a financial mindset that contributes to a sound future. You'll also discover: </p> <ul> <li>The answers to tough money questions, including the actual utility of new financial inventions like cryptocurrency</li> <li>How to think about exchanging your time and effort for money and the conditions under which you should agree to work</li> <li>Plain-English discussions of the principles of responsible long-term investing and how it differs from speculation</li> </ul> <p><br />Acting as a critical pillar for those seeking to build a rock-solid financial foundation, <i>Financial Literacy for All</i> is a must-have book for working professionals, blue-collar workers, members of young families, and established businesspeople looking for a better, more secure future for themselves and the ones they care about.</p>",
        "rating": null
    },
    {
        "name": "A Court of Thorns and Roses",
        "author": [
            "Sarah J. Maas"
        ],
        "popularity rank": 13,
        "genres": [
            "paranormal",
            "general",
            "fantasy",
            "romantic",
            "epic",
            "romance",
            "fairy tales, folk tales, legends & mythology"
        ],
        "description": "<p><b>The sexy, action-packed first book in the #1<i> New York Times</i> bestselling Court of Thorns and Roses series from Sarah J. Maas.</b> <p/>When nineteen-year-old huntress Feyre kills a wolf in the woods, a terrifying creature arrives to demand retribution. Dragged to a treacherous magical land she knows about only from legends, Feyre discovers that her captor is not truly a beast, but one of the lethal, immortal faeries who once ruled her world. <p/>At least, he's not a beast all the time. <p/>As she adapts to her new home, her feelings for the faerie, Tamlin, transform from icy hostility into a fiery passion that burns through every lie she's been told about the beautiful, dangerous world of the Fae. But something is not right in the faerie lands. An ancient, wicked shadow is growing, and Feyre must find a way to stop it, or doom Tamlin-and his world-forever. <p/>From bestselling author Sarah J. Maas comes a seductive, breathtaking book that blends romance, adventure, and faerie lore into an unforgettable read.</p>",
        "rating": 10.0
    },
    {
        "name": "Love, Mom: Inspiring Stories Celebrating Motherhood",
        "author": [
            "Nicole Saphier"
        ],
        "popularity rank": 14,
        "genres": [
            "parenting",
            "subjects & themes",
            "personal memoirs",
            "religious & inspirational",
            "motherhood"
        ],
        "description": "<p><strong>From Fox News medical contributor Dr. Nicole Saphier, comes an inspiring collection of powerful first-person stories celebrating motherhood, from Fox News personalities and extraordinary moms around America. </strong></p><p>Unmatched and unwavering, mothers are the embodiment of selfless, pure, and unconditional love. But so often, the sacrifices and triumphs of motherhood go unrecognized. Now, in <em>Love, Mom</em>, Fox News medical contributor and mom of three, Dr. Nicole Saphier, shines a light on the power of a mother's love, with inspiring first-person stories from moms in the Fox News family. </p><p>For Dr. Saphier--who was just a teenager when she gave birth to her first son--motherhood was a transformative responsibility. Her story, like so many moms featured in this book, is an inspiration for what it means to be there for your child, no matter where you are in life. Alongside Dr. Saphier's account are deeply personal contributions from FOX News anchors and personalities, such as: </p><ul><strong>Ainsley Earhardt</strong>, on the precious bond between mother and daughter, the loss of her own mom, and the power of her faith. </li><strong>Rachel Campos-Duffy</strong>, on raising nine children, unexpected blessings, and dedicating her life to advocating for education and awareness about children with Down Syndrome. </li><strong>Kayleigh McEnany, </strong> on embracing motherhood despite health challenges, and the delicate balance between career aspirations and the profound gift of raising children. </li><strong>Janice Dean, </strong> on navigating the heartbreak of miscarriage, living with an autoimmune disease, and finding joy in raising boys. </li><strong>Martha MacCallum</strong>, on the challenges of juggling career and family, the myth of perfection, and the importance of being kind to yourself. </li><strong>Sandra Smith</strong>, on how motherhood truly takes a village, and the value of a strong support system as a working mom. </li><strong>Carley Shimkus</strong>, on being a new mom, and balancing new responsibilities with grace and determination. </li></ul><p>In <em>Love, Mom</em>, these mothers share their powerful stories, greatest challenges, and insightful reflections about young motherhood, miscarriage, ovarian cancer, mixed race children, postpartum depression, domestic violence, adoption, blended families, and more. Ultimately, <em>Love, Mom</em> is a celebration of motherhood and reminds us that a mother's strength and love is an extraordinary gift. </p><br/>",
        "rating": null
    },
    {
        "name": "Just for the Summer",
        "author": [
            "Abby Jimenez"
        ],
        "popularity rank": 15,
        "genres": [
            "humorous",
            "romantic comedy",
            "women",
            "small town & rural",
            "general",
            "romance"
        ],
        "description": "<b>A sharp and scintillating summer novel that will make readers laugh out loud and cry happy tears from the <i>New York Times</i> bestselling author of <i>Yours Truly.</i></b><p> Justin has a curse, and thanks to a Reddit thread, it's now all over the internet. Every woman he dates goes on to find their soul mate the second they break up. When a woman slides into his DMs with the same problem, they come up with a plan: They'll date each other and break up. Their curses will cancel each other's out, and they'll both go on to find the love of their lives. It's a bonkers idea... and it just might work. </p><p> Emma hadn't planned that her next assignment as a traveling nurse would be in Minnesota, but she and her best friend agree that dating Justin is too good of an opportunity to pass up, especially when they get to rent an adorable cottage on a private island on Lake Minnetonka. <p/> It's supposed to be a quick fling, just for the summer. But when Emma's toxic mother shows up and Justin has to assume guardianship of his three siblings, they're suddenly navigating a lot more than they expected--including catching real feelings for each other. What if this time Fate has actually brought the perfect pair together? </p>",
        "rating": null
    },
    {
        "name": "Somehow: Thoughts on Love",
        "author": [
            "Anne Lamott"
        ],
        "popularity rank": 16,
        "genres": [
            "inspiration & personal growth",
            "general",
            "spirituality",
            "spiritual"
        ],
        "description": "<b>\"Anne Lamott is my Oprah.\" --<i>Chicago Tribune</i> <p/>From the bestselling author of <i>Dusk, Night, Dawn </i>and <i>Help, Thanks, Wow</i>, a joyful celebration of love</b> <p/>\"Love is our only hope,\" Anne Lamott writes in this perceptive new book. \"It is not always the easiest choice, but it is always the right one, the noble path, the way home to safety, no matter how bleak the future looks.\" <p/>In <i>Somehow: Thoughts on Love</i>, Lamott explores the transformative power that love has in our lives: how it surprises us, forces us to confront uncomfortable truths, reminds us of our humanity, and guides us forward. \"Love just won't be pinned down,\" she says. \"It is in our very atmosphere\" and lies at the heart of who we are. We are, Lamott says, creatures of love. <p/>In each chapter of <i>Somehow</i>, Lamott refracts all the colors of the spectrum. She explores the unexpected love for a partner later in life. The bruised (and bruising) love for a child who disappoints, even frightens. The sustaining love among a group of sinners, for a community in transition, in the wider world. The lessons she underscores are that love enlightens as it educates, comforts as it energizes, sustains as it surprises. <p/><i>Somehow </i>is Anne Lamott's twentieth book, and in it she draws from her own life and experience to delineate the intimate and elemental ways that love buttresses us in the face of despair as it galvanizes us to believe that tomorrow will be better than today. Full of the compassion and humanity that have made Lamott beloved by millions of readers, <i>Somehow </i>is classic Anne Lamott: funny, warm, and wise.",
        "rating": null
    },
    {
        "name": "You'd Look Better as a Ghost",
        "author": [
            "Joanna Wallace"
        ],
        "popularity rank": 17,
        "genres": [
            "humorous",
            "women",
            "black humor",
            "thrillers",
            "general"
        ],
        "description": "<b>\"Refreshingly original and laugh-out-loud funny.\" --Clare Mackintosh, <i>New York Times</i> bestselling author of <i>The Last Party</i> <p/>A comic thriller following the trials and tribulations of Claire, a part-time serial killer, who is keen to keep her favorite hobby a secret--despite the efforts of a determined blackmailer</b> <p/>The night after her father's funeral, Claire meets Lucas in a bar. Lucas doesn't know it, but it's not a chance meeting. One thoughtless mistyped email has put him in the crosshairs of an extremely put-out serial killer. But before they make eye contact, before Claire lets him buy her a drink--even before she takes him home and carves him up into little pieces--something about that night is very wrong. Because someone is watching Claire. Someone who is about to discover her murderous little hobby. <p/>The thing is, it's not sensible to tangle with a part-time serial killer, even one who is distracted by attending a weekly bereavement support group and trying to get her art career off the ground. Will Claire finish off her blackmailer before her pursuer reveals all? Let the games begin . . .",
        "rating": null
    },
    {
        "name": "My Dress-Up Darling 11",
        "author": [
            "Shinichi Fukuda"
        ],
        "popularity rank": 18,
        "genres": [
            "romance",
            "manga",
            "school life"
        ],
        "description": "<b>A loner boy and a flashy girl find common ground via cosplay in this sweet and spicy rom-com!</b> <p/>The <i>Coffin</i> group cosplay is a go, but before the blood and gore can fly, everyone gets to know one another a little better while planning and prepping. And the older cosplayers, only too happy to share their enthusiasm and skills, have a major surprise in store for lone-wolf cosplayer JuJu!! But even as she grudgingly acknowledges their efforts, JuJu ponders her future in cosplay, leaving everyone shook! Can her fellow cosplayers find a way to change her mind?!",
        "rating": null
    },
    {
        "name": "Haunting Adeline",
        "author": [
            "H D Carlton"
        ],
        "popularity rank": 19,
        "genres": [
            "action & adventure",
            "fantasy",
            "romantic",
            "gothic",
            "contemporary",
            "romance",
            "suspense"
        ],
        "description": "<p>The Manipulator</p><p>I can manipulate the emotions of anyone who lets me.</p><p>I will make you hurt, make you cry, make you laugh and sigh.</p><p>But my words don't affect him. Especially not when I plead for him to leave.</p><p>He's always there, watching and waiting.</p><p>And I can never look away.</p><p>Not when I want him to come closer.</p><p><br></p><p>The Shadow</p><p>I didn't mean to fall in love.</p><p>But now that I have, I can't stay away.</p><p>I'm mesmerized by her smile, by her eyes, and the way she moves.</p><p>The way she undresses...</p><p>I'll keep watching and waiting. Until I can make her mine.</p><p>And once she is, I'll never let her go.</p><p>Not even when she begs me to.</p><p><br></p><p><strong>While not required, it is highly suggested to read the novella, Satan's Affair, first.</strong></p><p><br></p><p>Author's Note: <strong>This book ends on a cliffhanger. For CWs, please check the author's website.</strong></p>",
        "rating": 7.1327434
    },
    {
        "name": "What Do You Do with an Idea? 10th Anniversary Edition",
        "author": [
            "Kobi Yamada",
            "Mae Besom"
        ],
        "popularity rank": 20,
        "genres": [
            "social themes",
            "self-esteem & self-reliance"
        ],
        "description": "The New York Times bestselling picture book What Do You Do With An Idea? has sold millions of copies and now has been artfully reimagined for a 10th Anniversary Commemorative Edition! With imaginative, enchanting illustrations and poignant words that will stir the heart, this book will spark your creativity and remind us all of the power and reach of a new idea. <p/>This 10th Anniversary Commemorative Edition includes: <br>- New and beautifully updated foiled cover art <br>- A special note from author Kobi Yamada on the creation of What Do You Do With an Idea?<br>- New introductory illustrations from artist Mae Besom<br>- New end paper designs <p/>What do you do with an idea? Especially an idea that's different, or daring, or just a little wild? Do you hide it? Walk away from it? Do you pretend it isn't yours? This is the story of one brilliant idea and the child who helps to bring it into the world. As the child's confidence grows, so does the idea itself. And then, one day, something amazing happens. <p/>Written by New York Times bestselling author, Kobi Yamada, this is a story for anyone, at any age, who's ever had an idea that seemed a little too big, too odd, too difficult. It's a story to inspire you to welcome that idea, to give it some space to grow, and to see what happens next. Because your idea isn't going anywhere. In fact, it's just getting started.",
        "rating": null
    },
    {
        "name": "Fourth Wing",
        "author": [
            "Rebecca Yarros"
        ],
        "popularity rank": 21,
        "genres": [
            "epic",
            "fantasy",
            "romantic"
        ],
        "description": "<p><b>An Instant <i>New York Times</i> Bestseller<br>A Goodreads Most Anticipated Book<br></b><br><i>\"Suspenseful, sexy, and with incredibly entertaining storytelling, the first in Yarros' Empyrean series will delight fans of romantic, adventure-filled fantasy.\"</i> --<i><b>Booklist</b></i><b>, starred review</b> <p/><i>\"</i>Fourth Wing<i> will have your heart pounding from beginning to end... A fantasy like you've never read before.\"</i> <b>―#1 <i>New York Times</i> bestselling author Jennifer L. Armentrout</b> <p/><b>Enter the brutal and elite world of a war college for dragon riders from <i>New York Times</i> bestselling author Rebecca Yarros</b> <p/>Twenty-year-old Violet Sorrengail was supposed to enter the Scribe Quadrant, living a quiet life among books and history. Now, the commanding general--also known as her tough-as-talons mother--has ordered Violet to join the hundreds of candidates striving to become the elite of Navarre: <i>dragon riders</i>. <p/>But when you're smaller than everyone else and your body is brittle, death is only a heartbeat away...because dragons don't bond to \"fragile\" humans. They incinerate them. <p/>With fewer dragons willing to bond than cadets, most would kill Violet to better their own chances of success. The rest would kill her just for being her mother's daughter--like Xaden Riorson, the most powerful and ruthless wingleader in the Riders Quadrant. <p/>She'll need every edge her wits can give her just to see the next sunrise. <p/>Yet, with every day that passes, the war outside grows more deadly, the kingdom's protective wards are failing, and the death toll continues to rise. Even worse, Violet begins to suspect leadership is hiding a terrible secret. <p/>Friends, enemies, lovers. Everyone at Basgiath War College has an agenda--because once you enter, there are only two ways out: <i>graduate or die</i>. <p/>The Empyrean series is best enjoyed in order.<br>Reading Order: <br>Book #1 Fourth Wing<br>Book #2 Iron Flame</p>",
        "rating": 8.0769234
    },
    {
        "name": "Iron Flame",
        "author": [
            "Rebecca Yarros"
        ],
        "popularity rank": 22,
        "genres": [
            "epic",
            "fantasy",
            "romantic"
        ],
        "description": "<p><b>NOTE TO READERS: </b>Preorder now and receive the stunning, LIMITED FIRST PRINT RUN--featuring spray-painted edges with gorgeously detailed map endpapers. This breathtaking first edition is only available for a limited time and while supplies last. <p/>Don't miss the explosive new sequel to Rebecca Yarros's bestselling hit, <i>Fourth Wing</i>. <p/>The Empyrean series is best enjoyed in order.<br>Reading Order: <br>Book #1 Fourth Wing<br>Book #2 Iron Flame</p>",
        "rating": 10.0
    },
    {
        "name": "Knife: Meditations After an Attempted Murder",
        "author": [
            "Salman Rushdie"
        ],
        "popularity rank": 23,
        "genres": [
            "cultural, ethnic & regional",
            "literary figures",
            "survival",
            "personal memoirs",
            "general",
            "discrimination & race relations"
        ],
        "description": "<b>From internationally renowned writer and Booker Prize winner Salman Rushdie, a searing, deeply personal account of enduring--and surviving--an attempt on his life thirty years after the fatwa that was ordered against him</b> <p/>Speaking out for the first time, and in unforgettable detail, about the traumatic events of August 12, 2022, Salman Rushdie answers violence with art, and reminds us of the power of words to make sense of the unthinkable.<i> Knife</i> is a gripping, intimate, and ultimately life-affirming meditation on life, loss, love, art--and finding the strength to stand up again.",
        "rating": null
    },
    {
        "name": "A Court of Mist and Fury",
        "author": [
            "Sarah J. Maas"
        ],
        "popularity rank": 24,
        "genres": [
            "action & adventure",
            "fantasy",
            "romantic",
            "epic",
            "general",
            "romance",
            "fairy tales, folk tales, legends & mythology"
        ],
        "description": "<p><b>The seductive and stunning #1 <i>New York Times</i> bestselling sequel to Sarah J. Maas's spellbinding <i>A Court of Thorns and Roses</i>.</b> <p/>Feyre has undergone more trials than one human woman can carry in her heart. Though she's now been granted the powers and lifespan of the High Fae, she is haunted by her time Under the Mountain and the terrible deeds she performed to save the lives of Tamlin and his people. <p/>As her marriage to Tamlin approaches, Feyre's hollowness and nightmares consume her. She finds herself split into two different people: one who upholds her bargain with Rhysand, High Lord of the feared Night Court, and one who lives out her life in the Spring Court with Tamlin. While Feyre navigates a dark web of politics, passion, and dazzling power, a greater evil looms. She might just be the key to stopping it, but only if she can harness her harrowing gifts, heal her fractured soul, and decide how she wishes to shape her future-and the future of a world in turmoil. <p/>Bestselling author Sarah J. Maas's masterful storytelling brings this second book in her dazzling, sexy, action-packed series to new heights.</p>",
        "rating": 7.8943896
    },
    {
        "name": "James",
        "author": [
            "Percival Everett"
        ],
        "popularity rank": 25,
        "genres": [
            "general",
            "historical",
            "satire",
            "literary"
        ],
        "description": "<b>NAMED A MOST ANTICIPATED BOOK OF THE YEAR BY TIME, NPR, THE SEATTLE TIMES, ELLE, THE ATLANTA JOURNAL-CONSTITUTION, AND OPRAH DAILY <p/>A brilliant, action-packed reimagining of <i>Adventures of Huckleberry Finn</i>, both harrowing and ferociously funny, told from the enslaved Jim's point of view - From the \"literary icon\" (<i>Oprah Daily</i>) and Pulitzer Prize Finalist whose novel <i>Erasure</i> is the basis for Cord Jefferson's critically acclaimed film <i>American Fiction</i> <p/><i>\"</i>If you liked <i>Demon Copperhead, </i> by Barbara Kingsolver, read J<i>ames, </i> by Percival Everett\" --<i>The Washington Post</i></b> <p/>When the enslaved Jim overhears that he is about to be sold to a man in New Orleans, separated from his wife and daughter forever, he decides to hide on nearby Jackson Island until he can formulate a plan. Meanwhile, Huck Finn has faked his own death to escape his violent father, recently returned to town. As all readers of American literature know, thus begins the dangerous and transcendent journey by raft down the Mississippi River toward the elusive and too-often-unreliable promise of the Free States and beyond. <p/>While many narrative set pieces of <i>Adventures of Huckleberry Finn</i> remain in place (floods and storms, stumbling across both unexpected death and unexpected treasure in the myriad stopping points along the river's banks, encountering the scam artists posing as the Duke and Dauphin...), Jim's agency, intelligence and compassion are shown in a radically new light. <p/>Brimming with the electrifying humor and lacerating observations that have made Everett a \"literary icon\" (<i>Oprah Daily</i>), and one of the most decorated writers of our lifetime, <i>James </i>is destined to be a major publishing event and a cornerstone of twenty-first century American literature.",
        "rating": 8.0
    },
    {
        "name": "A Court of Wings and Ruin",
        "author": [
            "Sarah J. Maas"
        ],
        "popularity rank": 26,
        "genres": [
            "epic",
            "fantasy",
            "romantic",
            "fairy tales, folk tales, legends & mythology"
        ],
        "description": "<p><b>The epic third novel in the #1 <i>New York Times </i>bestselling Court of Thorns and Roses series by Sarah J. Maas.</b> <p/>Feyre has returned to the Spring Court, determined to gather information on Tamlin's actions and learn what she can about the invading king threatening to bring her land to its knees. But to do so she must play a deadly game of deceit. One slip could bring doom not only for Feyre, but for everything-and everyone-she holds dear. <p/>As war bears down upon them all, Feyre endeavors to take her place amongst the High Fae of the land, balancing her struggle to master her powers-both magical and political-and her love for her court and family. Amidst these struggles, Feyre and Rhysand must decide whom to trust amongst the cunning and lethal High Lords, and hunt for allies in unexpected places. <p/>In this thrilling third book in the #1 New York Times bestselling series from Sarah J. Maas, the fate of Feyre's world is at stake as armies grapple for power over the one thing that could destroy it.</p>",
        "rating": 8.153846
    },
    {
        "name": "Atomic Habits: An Easy & Proven Way to Build Good Habits & Break Bad Ones",
        "author": [
            "James Clear"
        ],
        "popularity rank": 27,
        "genres": [
            "organizational behavior",
            "general",
            "personal growth",
            "social psychology"
        ],
        "description": "<b>The #1<i> New York Times</i> bestseller. Over 10 million copies sold! <p/><i>Tiny Changes, Remarkable Results</i></b> <p/>No matter your goals, <i>Atomic Habits</i> offers a proven framework for improving--every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results. <p/>If you're having trouble changing your habits, the problem isn't you. The problem is your system. Bad habits repeat themselves again and again not because you don't want to change, but because you have the wrong system for change. You do not rise to the level of your goals. You fall to the level of your systems. Here, you'll get a proven system that can take you to new heights. <p/>Clear is known for his ability to distill complex topics into simple behaviors that can be easily applied to daily life and work. Here, he draws on the most proven ideas from biology, psychology, and neuroscience to create an easy-to-understand guide for making good habits inevitable and bad habits impossible. Along the way, readers will be inspired and entertained with true stories from Olympic gold medalists, award-winning artists, business leaders, life-saving physicians, and star comedians who have used the science of small habits to master their craft and vault to the top of their field. <p/>Learn how to: <br><ul><li>make time for new habits (even when life gets crazy);</li></ul><ul><li>overcome a lack of motivation and willpower;</li></ul><ul><li>design your environment to make success easier;</li></ul><ul><li>get back on track when you fall off course;</li></ul>...and much more. <p/><i>Atomic Habits</i> will reshape the way you think about progress and success, and give you the tools and strategies you need to transform your habits--whether you are a team looking to win a championship, an organization hoping to redefine an industry, or simply an individual who wishes to quit smoking, lose weight, reduce stress, or achieve any other goal.",
        "rating": 8.173913
    },
    {
        "name": "Briefly Perfectly Human: Making an Authentic Life by Getting Real about the End",
        "author": [
            "Alua Arthur"
        ],
        "popularity rank": 28,
        "genres": [
            "death & dying",
            "death, grief, bereavement",
            "terminal care",
            "mental health",
            "personal memoirs",
            "inspiration & personal growth"
        ],
        "description": "<p><strong>A deeply transformative memoir that reframes how we think about death and how it can help us lead better, more fulfilling and authentic lives, from America's most visible death doula.</strong></p><p><strong>\"A</strong><strong> truly unique, inspiring perspective on the time we have, what we do with it, and how we let go of this world.... There is no one I'd trust more to guide me through an understanding of death, and how it informs life.</strong><strong>\" </strong>-- <strong>Jodi Picoult, <em>New York Times</em> bestselling author of <em>Mad Honey</em> and <em>The Book of Two Ways</em></strong></p><p><strong>\"<em>Briefly Perfectly Human </em>is a beautiful, raw, light-bringing experience. Alua's voice is shimmering, singular, and pulses with humor, vulnerability, insight, and refreshing candor.... Be prepared for it to grab you, hold you tight, and raise the roof on the power of human connection.\" </strong>-- <strong>Tembi Locke, author of <em>From Scratch: A Memoir of Love, Sicily, and Finding Home</em></strong></p><p>For her clients and everyone who has been inspired by her humanity, Alua Arthur is a friend at the end of the world. As our country's leading death doula, she's spreading a transformative message: <em>thinking </em>about your death--whether imminent or not--will breathe wild, new potential into your life.</p><p>Warm, generous, and funny AF, Alua supports and helps manage end-of-life care on many levels. The business matters, medical directives, memorial planning; but also honoring the quiet moments, when monitors are beeping and loved ones have stepped out to get some air--or maybe not shown up at all--and her clients become deeply contemplative and want to talk. Aching, unfinished business often emerges. Alua has been present for thousands of these sacred moments--when regrets, fears, secret joys, hidden affairs, and dim realities are finally said aloud. When this happens, Alua focuses her attention at the pulsing center of her clients' anguish and creates space for them, and sometimes their loved ones, to find peace.</p><p>This has had a profound effect on Alua, who was already no stranger to death's periphery. Her family fled a murderous coup d'état in Ghana in the 1980s. She has suffered major, debilitating depressions. And her dear friend and brother-in-law died of lymphoma. Advocating for him in his final months is what led Alua to her life's calling. She knows firsthand the power of bearing witness and telling the truth about life's painful complexities, because they do not disappear when you look the other way. They wait for you.</p><p><em>Briefly Perfectly Human</em> is a life-changing, soul-gathering debut, by a writer whose empathy, tenderness, and wisdom shimmers on the page. Alua Arthur combines intimate storytelling with a passionate appeal for loving, courageous end-of-life care--what she calls \"death embrace.\" Hers is a powerful testament to getting in touch with something deeper in our lives, by embracing the fact of our own mortality. \"Hold that truth in your mind,\" Alua says, \"and wondrous things will begin to grow around it.\"</p>",
        "rating": null
    },
    {
        "name": "Wild Love",
        "author": [
            "Elsie Silver"
        ],
        "popularity rank": 29,
        "genres": [
            "romance",
            "western",
            "contemporary"
        ],
        "description": "<p><strong>She's been driving him wild for years.</strong></p><p><strong>The good kind of wild. The bad kind of wild.</strong></p><p><strong>But mostly, the kind of wild that comes with wanting your best friend's little sister and knowing you can't have her.</strong></p><p>Forbes may have labeled Ford Grant the World's Hottest Billionaire, but all he cares about is escaping the press and opening a recording studio in gorgeous small town Rose Hill. Something that comes to a screeching halt when he ends up face-to-face with a young girl who claims he's her biological father. Now, he spends his days balancing business with parenting a sullen twelve-year-old, all while trying desperately to keep his hands the hell off his best friend's sister, Rosie Belmont.</p><p>After living in the city, Rosie came blasting back into town like a storm. Beautiful, messy, and chaotic. And one wide-eyed, desperate plea for a job is all it takes for Ford to hire her. He vows to keep her at arm's length. Tries to stick to scowls and grumpy one-liners. But with her, verbal sparring is a type of foreplay--friction that soon turns to blistering heat.</p><p>Ford knows damn well he shouldn't cross this line. But shouldn't and can't are two very different things.</p><p>And the only thing he truly can't do is resist her.</p>",
        "rating": null
    },
    {
        "name": "If He Had Been with Me",
        "author": [
            "Laura Nowlin"
        ],
        "popularity rank": 30,
        "genres": [
            "friendship",
            "social themes",
            "dating & sex",
            "thrillers & suspense",
            "contemporary",
            "romance",
            "coming of age",
            "mysteries & detective stories"
        ],
        "description": "<p><strong>A <em>New York Times</em> Bestseller</strong></p><p><strong>*A BookTok Viral Sensation* </strong></p><p><strong>An achingly authentic and raw portrait of love, regret, and the life-altering impact of the relationships we hold closest to us, this YA romance bestseller is perfect for fans of Colleen Hoover, Jenny Han, and <em>You've Reached Sam. </em></strong></p><p><em>If he had been with me, everything would have been different...</em></p><p>Autumn and Finn used to be inseparable. But then something changed. Or they changed. Now, they do their best to ignore each other.</p><p>Autumn has her boyfriend Jamie, and her close-knit group of friends. And Finn has become that boy at school, the one everyone wants to be around.</p><p>That still doesn't stop the way Autumn feels every time she and Finn cross paths, and the growing, nagging thought that maybe things could have been different. Maybe they should be together.</p><p>But come August, things will change forever. And as time passes, Autumn will be forced to confront how else life might have been different if they had never parted ways...</p><p><strong>Captivating and heartbreaking, <em> If He Had Been with Me</em> is perfect for readers looking for: </strong></p><ul><li>Contemporary teen romance books</li><li>Unputdownable & bingeworthy novels</li><li>Complex emotional YA stories</li><li>TikTok Books</li><li>Jenny Han meets <em>Dear Even Hanson</em></li><li>Colleen Hover fans</li></ul>",
        "rating": 8.037736
    },
    {
        "name": "Bluey: Little Library 4-Book Box Set",
        "author": [
            "Penguin Young Readers Licenses"
        ],
        "popularity rank": 31,
        "genres": [
            "friendship",
            "social themes",
            "media tie-in",
            "animals",
            "dogs"
        ],
        "description": "<b>Meet Bluey, Bingo, Mum, and Dad in this little library box set! Based on the successful animated series <i>Bluey</i>, as seen on Disney+</b> <p/>Perfect for young readers, each board book introduces Bluey and her family. Find out what Bluey likes to dress up as, Dad's favorite things, what Bingo likes to play in this fun and box set that's when you're on the move!",
        "rating": null
    },
    {
        "name": "Dune (Anniversary)",
        "author": [
            "Frank Herbert"
        ],
        "popularity rank": 32,
        "genres": [
            "classics",
            "science fiction",
            "action & adventure",
            "fantasy",
            "space opera",
            "epic"
        ],
        "description": "<b>- DUNE: PART TWO - THE MAJOR MOTION PICTURE COMING NOVEMBER 3rd, 2023<br></b>Directed by Denis Villeneuve, screenplay by Denis Villeneuve and Jon Spaihts, based on the novel <i>Dune</i> by Frank Herbert - Starring Timothée Chalamet, Zendaya, Rebecca Ferguson, Josh Brolin, Austin Butler, Florence Pugh, Dave Bautista, Christopher Walken, Stephen McKinley Henderson, Léa Seydoux, with Stellan Skarsgård, with Charlotte Rampling, and Javier Bardem<b> <p/><b>Frank Herbert's classic masterpiece--a triumph of the imagination and one of the bestselling science fiction novels of all time.</b></b> <p/>Set on the desert planet Arrakis, <i>Dune</i> is the story of the boy Paul Atreides, heir to a noble family tasked with ruling an inhospitable world where the only thing of value is the \"spice\" melange, a drug capable of extending life and enhancing consciousness. Coveted across the known universe, melange is a prize worth killing for.... <p/>When House Atreides is betrayed, the destruction of Paul's family will set the boy on a journey toward a destiny greater than he could ever have imagined. And as he evolves into the mysterious man known as Muad'Dib, he will bring to fruition humankind's most ancient and unattainable dream. <p/>A stunning blend of adventure and mysticism, environmentalism and politics, <i>Dune</i> won the first Nebula Award, shared the Hugo Award, and formed the basis of what is undoubtedly the grandest epic in science fiction.",
        "rating": 8.5370368
    },
    {
        "name": "Happy Place",
        "author": [
            "Emily Henry"
        ],
        "popularity rank": 33,
        "genres": [
            "romance",
            "romantic comedy",
            "women"
        ],
        "description": "<b><b>INSTANT #1 NEW YORK TIMES BESTSELLER! <p/>\"The beach-read master hooks us again.\"--<i>People </i></b> <p/>Named a Most Anticipated Book of 2023 by BuzzFeed ∙ Paste Magazine ∙ Elle <b>∙</b> Southern Living ∙ <b>SheReads <b>∙</b> Culturess <b>∙ Medium <b>∙ Her Campus <b>∙</b> Readers Digest <b>∙ Zibby Mag</b></b></b></b> and more! <p/>A couple who broke up months ago pretend to still be together for their annual weeklong vacation with their best friends in this glittering and wise new novel from #1 <i>New York Times</i> bestselling author Emily Henry.</b> <p/> Harriet and Wyn have been the perfect couple since they met in college--they go together like salt and pepper, honey and tea, lobster and rolls. Except, now--for reasons they're still not discussing--they don't. <p/> They broke up five months ago. And still haven't told their best friends. <p/> Which is how they find themselves sharing a bedroom at the Maine cottage that has been their friend group's yearly getaway for the last decade. Their annual respite from the world, where for one vibrant, blissful week they leave behind their daily lives; have copious amounts of cheese, wine, and seafood; and soak up the salty coastal air with the people who understand them most. <p/> Only this year, Harriet and Wyn are lying through their teeth while trying not to notice how desperately they still want each other. Because the cottage is for sale and this is the last week they'll all have together in this place. They can't stand to break their friends' hearts, and so they'll play their parts. Harriet will be the driven surgical resident who never starts a fight, and Wyn will be the laid-back charmer who never lets the cracks show. It's a flawless plan (if you look at it from a great distance and through a pair of sunscreen-smeared sunglasses). After years of being in love, how hard can it be to fake it for one week...in front of those who know you best?",
        "rating": 5.0
    },
    {
        "name": "Butcher & Blackbird: The Ruinous Love Trilogy",
        "author": [
            "Brynne Weaver"
        ],
        "popularity rank": 34,
        "genres": [
            "romance",
            "romantic comedy",
            "new adult",
            "suspense"
        ],
        "description": "<p><b>The viral TikTok friends-to-lovers dark romantic comedy full of murder, chaos, and sizzling chemistry-unlike anything you've read before-now available in all bookstores </b> <p/>When a chance encounter sparks an unlikely bond between rival murderers Sloane and Rowan, they find something elusive-the friendship of two like-minded, pitch-black souls who just happen to enjoy killing <i>other</i> serial killers. <p/>From small-town West Virginia to upscale California, and from downtown Boston to rural Texas, the two hunters collide in an annual game of blood and suffering, one that pits them against the most dangerous monsters in the country. <p/>But as their friendship develops into something more, the restless ghosts left in their wake are only a few steps behind, ready to claim more than just their newfound love. <p/>Can Rowan and Sloane dig themselves out of a game of graves?<br>Or have they finally met their match?</p>",
        "rating": 7.6
    },
    {
        "name": "Late Bloomer",
        "author": [
            "Mazey Eddings"
        ],
        "popularity rank": 35,
        "genres": [
            "romance",
            "romantic comedy"
        ],
        "description": "<p><b>A sexy, sapphic, opposites-attract romance with Mazey Eddings' signature sparkling voice! </b> <p/>Winning the lottery has ruined Opal Devlin's life. After quitting her dead-end job where she'd earned minimum wage and even less respect, she's bombarded by people knocking at her door for a handout the second they found out her bank account was overflowing with cash. And Opal can't seem to stop saying yes. <p/>With her tender heart thoroughly abused, Opal decides to protect herself by any means necessary, which to her translates to putting almost all her new money to buying a failing flower farm in Asheville, North Carolina to let the flowers live out their plant destiny while she uses the cabin on the property to start her painting business. <p/>But her plans for isolation and self-preservation go hopelessly awry when an angry (albeit gorgeous) Pepper Boden is waiting for her at her new farm. Pepper states she's the rightful owner of Thistle and Bloom Farms, and isn't moving out. The unlikely pair strike up an agreement of co-habitation, and butt heads at every turn. Can these opposites both live out their dreams and plant roots? Or will their combustible arguing (and growing attraction) burn the whole place down?</p>",
        "rating": null
    },
    {
        "name": "Toxic Prey",
        "author": [
            "John Sandford"
        ],
        "popularity rank": 36,
        "genres": [
            "crime",
            "mystery & detective",
            "thrillers",
            "general",
            "suspense"
        ],
        "description": "<b>Lucas Davenport and his daughter, Letty, team up to track down a dangerous scientist whose latest project could endanger the entire world, in this latest thriller from #1 <i>New York Times </i>bestselling author John Sandford.</b> <p/><i>Gaia is dying</i>. <p/>That, at least, is what Dr. Lionel Scott believes. A renowned expert in tropical and infectious diseases, Scott has witnessed the devastating impact of illness and turmoil at critical scale. Society as it exists is untenable, and the direct link to Earth's death spiral; population levels are out of control and people have allowed disarray and disorder to run rampant. While most are concerned about deadly disease, Scott knows that it is truly humanity itself that will destroy Gaia. It's only by removing the threat that the planet can continue to prosper, and luckily, Scott is just the right man for the job... <p/><b> </b><br>When Scott then disappears without a trace, Letty Davenport is tasked with tracking down any and all leads. Scott's connections to sensitive research into virus and pathogen spread has multiple national and international organizations on high alert, and his shockingly high clearance levels at various institutions, including the Los Alamos National Laboratory, make him the last person they'd like to go missing. As the web around Scott becomes more tangled, Letty calls in her father, Lucas, help her lead a group of specialists to find Scott as soon as possible. But as Letty and Lucas begin to uncover startling and disturbing connections between Scott and Gaia conspiracists, their worst fears are confirmed, and it quickly becomes a race to find him before the virus he created becomes the perfect weapon.",
        "rating": null
    },
    {
        "name": "Close to Death",
        "author": [
            "Anthony Horowitz"
        ],
        "popularity rank": 37,
        "genres": [
            "crime",
            "mystery & detective",
            "amateur sleuth",
            "thrillers",
            "traditional"
        ],
        "description": "<p><strong>In <em>New York Times</em> bestselling author Anthony Horowitz's ingenious fifth literary whodunnit in the Hawthorne and Horowitz series, Detective Hawthorne is once again called upon to solve an unsolvable case--a gruesome murder in an idyllic gated community in which suspects abound.</strong></p> <p>Riverside Close is a picture-perfect community. The six exclusive and attractive houses are tucked far away from the noise and grime of city life, allowing the residents to enjoy beautiful gardens, pleasant birdsong, and tranquility from behind the security of a locked gate.</p><p>It is the perfect idyll, until the Kentworthy family arrives, with their four giant, gas-guzzling cars, gaggle of shrieking children, and plans for a garish swimming pool in the backyard. Obvious outsiders, the Kentworthys do not belong in Riverside Close, and quickly offend every last one of the neighbors.</p><p>When Charles Kentworthy is found dead on his own doorstep, a crossbow bolt sticking out of his chest, Detective Hawthorne is the only investigator they can call to solve the case.</p><p>Because how do you solve a murder when everyone is a suspect?</p>",
        "rating": null
    },
    {
        "name": "One Dark Window",
        "author": [
            "Rachel Gillig"
        ],
        "popularity rank": 38,
        "genres": [
            "epic",
            "fantasy",
            "dark fantasy",
            "gothic"
        ],
        "description": "<p><b>THE FANTASY BOOKTOK SENSATION! <p/> For fans of <i>Uprooted</i> and <i>For the Wolf </i>comes a dark, lushly gothic fantasy about a maiden who must unleash the monster within to save her kingdom--but the monster in her head isn't the only threat lurking.</b> <p/> Elspeth needs a monster. The monster might be her. <p/> Elspeth Spindle needs more than luck to stay safe in the eerie, mist-locked kingdom she calls home--she needs a monster. She calls him the Nightmare, an ancient, mercurial spirit trapped in her head. He protects her. He keeps her secrets. </p><p> But nothing comes for free, especially magic. </p><p> When Elspeth meets a mysterious highwayman on the forest road, her life takes a drastic turn. Thrust into a world of shadow and deception, she joins a dangerous quest to cure the kingdom of the dark magic infecting it. Except the highwayman just so happens to be the King's own nephew, Captain of the Destriers...and guilty of high treason. </p><p> He and Elspeth have until Solstice to gather twelve Providence Cards--the keys to the cure. But as the stakes heighten and their undeniable attraction intensifies, Elspeth is forced to face her darkest secret yet: the Nightmare is slowly, darkly, taking over her mind. And she might not be able to stop him. </p>",
        "rating": 10.0
    },
    {
        "name": "1984: 75th Anniversary",
        "author": [
            "George Orwell"
        ],
        "popularity rank": 39,
        "genres": [
            "classics",
            "political",
            "psychological",
            "science fiction",
            "literary",
            "dystopian",
            "cultural heritage",
            "historical",
            "20th century",
            "general",
            "romance"
        ],
        "description": "1984 has come and gone, but George Orwell's prophetic, nightmare vision in 1949 of the world we were becoming is timelier than ever. \"1984\" is still the great modern classic \"negative Utopia\" - a startling original and haunting novel that creates an imaginary world that is completely convincing from the first sentence to the last four words. No one can deny this novel's power, its hold on the imagination of whole generations, or the power of its admonitions - a power that seems to grow, not lessen, with the passage of time.",
        "rating": 8.16
    },
    {
        "name": "Throne of Glass",
        "author": [
            "Sarah J. Maas"
        ],
        "popularity rank": 40,
        "genres": [
            "royalty",
            "paranormal",
            "fantasy & magic",
            "action & adventure",
            "fantasy",
            "romantic",
            "epic",
            "general",
            "romance",
            "love & romance"
        ],
        "description": "<p><b>Lethal. Loyal. Legendary.</b> <p/>Enter the world of Throne of Glass with the first book in the #1 bestselling series by Sarah J. Maas. <p/>In a land without magic, an assassin is summoned to the castle. She has no love for the vicious king who rules from his throne of glass, but she has not come to kill him. She has come to win her freedom. If she defeats twenty-three murderers, thieves, and warriors in a competition, she will be released from prison to serve as the King's Champion. <p/>Her name is Celaena Sardothien. <p/>The Crown Prince will provoke her. The Captain of the Guard will protect her. And a princess from a faraway country will befriend her. But something rotten dwells in the castle, and it's there to kill. When her competitors start dying mysteriously, one by one, Celaena's fight for freedom becomes a fight for survival-and a desperate quest to root out the evil before it destroys her world. <p/>Thrilling and fierce, Throne of Glass is the first book in the #1 <i>New York Times</i> bestselling series that has captivated readers worldwide.</p>",
        "rating": 8.474576
    },
    {
        "name": "To Gaze Upon Wicked Gods",
        "author": [
            "Molly X. Chang"
        ],
        "popularity rank": 41,
        "genres": [
            "cultural heritage",
            "action & adventure",
            "fantasy",
            "epic"
        ],
        "description": "<b>She has power over death. He has power over her. When two enemies strike a dangerous bargain, will they end a war . . . or ignite one?</b><br><b> </b><br><b>\"With hauntingly poetic prose, Molly X. Chang spins a tale at the intersection of science fiction, fantasy, and the very real devastation that colonialism brings down on colonized peoples.\"--Xiran Jay Zhao, #1 <i>New York Times</i> bestselling author of <i>Iron Widow</i></b> <p/><b>The gorgeous first edition hardcover of <i>To Gaze Upon Wicked Gods</i> will feature a poster, color endpapers, a custom-stamped case, and a foil jacket!</b> <p/><i>Heroes die, cowards live. </i>Daughter of a conquered world, Ruying hates the invaders who descended from the heavens long before she was born and defeated the magic of her people with technologies unlike anything her world had ever seen. <p/>Blessed by Death, born with the ability to pull the life right out of mortal bodies, Ruying shouldn't have to fear these foreign invaders, but she does. Especially because she wants to keep herself and her family safe. <p/>When Ruying's Gift is discovered by an enemy prince, he offers her an impossible deal: If she becomes his private assassin and eliminates his political rivals--whose deaths he swears would be for the good of both their worlds and would protect her people from further brutalization--her family will never starve or suffer harm again. But to accept this bargain, she must use the powers she has always feared, powers that will shave years off her own existence. <p/>Can Ruying trust this prince, whose promises of a better world make her heart ache and whose smiles make her pulse beat faster? Are the evils of this agreement really in the service of a much greater good? Or will she betray her entire nation by protecting those she loves the most?",
        "rating": null
    },
    {
        "name": "A Court of Silver Flames",
        "author": [
            "Sarah J. Maas"
        ],
        "popularity rank": 42,
        "genres": [
            "action & adventure",
            "fantasy",
            "romantic",
            "epic",
            "romance"
        ],
        "description": "<p><b>Sarah J. Maas's sexy, richly imagined series continues with the journey of Feyre's fiery sister, Nesta. </b> <p/>Nesta Archeron has always been prickly-proud, swift to anger, and slow to forgive. And ever since being forced into the Cauldron and becoming High Fae against her will, she's struggled to find a place for herself within the strange, deadly world she inhabits. Worse, she can't seem to move past the horrors of the war with Hybern and all she lost in it. <p/>The one person who ignites her temper more than any other is Cassian, the battle-scarred warrior whose position in Rhysand and Feyre's Night Court keeps him constantly in Nesta's orbit. But her temper isn't the only thing Cassian ignites. The fire between them is undeniable, and only burns hotter as they are forced into close quarters with each other. <p/>Meanwhile, the treacherous human queens who returned to the Continent during the last war have forged a dangerous new alliance, threatening the fragile peace that has settled over the realms. And the key to halting them might very well rely on Cassian and Nesta facing their haunting pasts. <p/>Against the sweeping backdrop of a world seared by war and plagued with uncertainty, Nesta and Cassian battle monsters from within and without as they search for acceptance-and healing-in each other's arms.</p>",
        "rating": 9.263158
    },
    {
        "name": "Twisted Love",
        "author": [
            "Ana Huang"
        ],
        "popularity rank": 43,
        "genres": [
            "romance",
            "new adult"
        ],
        "description": "<p><strong><em>He has a heart of ice...but for her, he'd burn the world</em></strong></p><p>A diverse new adult steamy romance from Tiktok sensation and <em>USA Today </em>bestselling author Ana Huang.</p><p>Alex Volkov is a devil blessed with the face of an angel and cursed with a past he can't escape.</p><p>Driven by a tragedy that has haunted him for most of his life, his ruthless pursuits for success and vengeance leave little room for matters of the heart.</p><p>But when he's forced to look after his best friend's sister, he starts to feel something in his chest: </p><p>A crack.</p><p>A melt.</p><p>A fire that could end his world as he knew it.</p><p>***</p><p>Ava Chen is a free spirit trapped by nightmares of a childhood she can't remember.</p><p>But despite her broken past, she's never stopped seeing the beauty in the world...including the heart beneath the icy exterior of a man she shouldn't want.</p><p>Her brother's best friend.</p><p>Her neighbor.</p><p>Her savior and her downfall.</p><p>Theirs is a love that was never supposed to happen-but when it does, it unleashes secrets that could destroy them both...and everything they hold dear.</p><p><em>Twisted Love is a contemporary brother's best friend/grumpy sunshine romance. It's book one in the Twisted series but can be read as a standalone.</em></p>",
        "rating": 7.6417908
    },
    {
        "name": "Powerless",
        "author": [
            "Lauren Roberts"
        ],
        "popularity rank": 44,
        "genres": [
            "social themes",
            "fantasy",
            "romance",
            "class differences"
        ],
        "description": "<b>This sparkling edition includes a special case stamping, bonus content, and a teaser to book two in this heart-pounding series! </b> <p/><b>Perfect for fans of Sarah J. Maas, this young adult fantasy follows the forbidden romance between a powerful prince and an ordinary girl as they try to survive their kingdom's grueling laws pitting them against each other.</b> <p/><i>She is the very thing he's spent his whole life hunting. </i><br> <i>He is the very thing she's spent her whole life pretending to be.</i> <p/>Only the extraordinary belong in the kingdom of Ilya--the exceptional, the empowered, the Elites. The powers these Elites have possessed for decades were graciously gifted to them by the Plague, though not all were fortunate enough to both survive the sickness and reap the reward. Those born Ordinary are just that--ordinary. And when the king decreed that all Ordinaries be banished to preserve his Elite society, lacking an ability suddenly became a crime--making Paedyn Gray a felon by fate and a thief by necessity. <p/>Surviving in the slums as an Ordinary is no simple task, and Paedyn knows this better than most. Having been trained by her father to be keenly observant since she was a child, Paedyn poses as a Psychic in the crowded city, blending in with the Elites as best she can to stay alive and out of trouble...easier said than done. <p/>When Paeydn unsuspectingly saves one of Ilya's princes, she finds herself thrown into the Purging Trials. The brutal competition exists to showcase the Elites' powers--the very thing Paedyn lacks. If the Trials and the opponents within them don't kill her, the prince she's fighting feelings for certainly will if he discovers what she is...completely Ordinary.",
        "rating": 9.0
    },
    {
        "name": "Who Is Taylor Swift?",
        "author": [
            "Who Hq",
            "Kirsten Anderson",
            "Gregory Copeland"
        ],
        "popularity rank": 45,
        "genres": [
            "biography & autobiography",
            "music",
            "popular",
            "women"
        ],
        "description": "<b> Learn how a young girl who lived on a Christmas tree farm grew up to become one of the most celebrated musical artists of the twenty-first century in this addition to the #1 <i>New York Times</i> Best-Selling Series.</b> <p/>Taylor Swift always knew she wanted to be a country music artist, so at age thirteen, she convinced her parents to move their family out of Pennsylvania to Nashville. <p/>As a singer, songwriter, and guitarist, Taylor wrote songs about teenage heartbreak and fitting in with her peers, and she performed these and other tunes at open mic nights and karaoke events. Breaking into the music industry took longer than she expected because record executives thought there was no place in country music for her songs. But Taylor was fearless and proved them wrong. <p/>Since the release of her self-titled debut album in 2006, Taylor Swift has dominated the music charts, reinvented her sound, won numerous awards, shaken off public criticism, and spoken up for herself and others. <p/>Whether you're a lifelong Swiftie or someone who just loves learning about musicians, this enchanting book will teach you all about the experiences that helped Taylor Swift become the successful superstar many kids and adults looks up to.",
        "rating": null
    },
    {
        "name": "The Housemaid",
        "author": [
            "Freida McFadden"
        ],
        "popularity rank": 46,
        "genres": [
            "thrillers",
            "psychological",
            "suspense"
        ],
        "description": "<b>Don't miss the <i>New York Times </i>and <i>USA Today </i>bestseller and addictive psychological thriller with a jaw-dropping twist that's burning up Instagram and TikTok--Freida McFadden's <i>The Housemaid</i> is perfect for fans of Ruth Ware, Lisa Jewell, and </b><i><b>Verity.</b></i> <p/><b>\"Welcome to the family,\" Nina Winchester says as I shake her elegant, manicured hand. I smile politely, gazing around the marble hallway. Working here is my last chance to start fresh. I can pretend to be whoever I like. But I'll soon learn that the Winchesters' secrets are far more dangerous than my own...</b> <p/> Every day I clean the Winchesters' beautiful house top to bottom. I collect their daughter from school. And I cook a delicious meal for the whole family before heading up to eat alone in my tiny room on the top floor. <p/> I try to ignore how Nina makes a mess just to watch me clean it up. How she tells strange lies about her own daughter. And how her husband Andrew seems more broken every day. But as I look into Andrew's handsome brown eyes, so full of pain, it's hard not to imagine what it would be like to live Nina's life. The walk-in closet, the fancy car, the perfect husband. <p/> I only try on one of Nina's pristine white dresses once. Just to see what it's like. But she soon finds out... and by the time I realize my attic bedroom door only locks from the outside, it's far too late. <p/> But I reassure myself: the Winchesters don't know who I really am. <p/> They don't know what I'm capable of...",
        "rating": 9.0
    },
    {
        "name": "A Fate Inked in Blood: Book One of the Saga of the Unfated",
        "author": [
            "Danielle L. Jensen"
        ],
        "popularity rank": 47,
        "genres": [
            "historical",
            "fantasy",
            "romantic",
            "romance",
            "viking"
        ],
        "description": "<b>A shield maiden blessed by the gods battles to unite a nation under a power-hungry king--while fighting her growing desire for his fiery son--in the first book of a Norse-inspired fantasy romance series from the bestselling author of The Bridge Kingdom series. <p/><b>The stunning first edition hardcover of <i>A Fate Inked in Blood</i> will feature foil page edges, a custom-stamped case, and a premium dust jacket!</b></b> <p/>Bound in an unwanted marriage, Freya spends her days gutting fish but dreams of becoming a warrior. And of putting an axe in her boorish husband's back. <p/>Freya's dreams abruptly become reality when her husband betrays her to the region's jarl, landing her in a fight to the death against his son, Bjorn. To survive, Freya is forced to reveal her deepest secret: She possesses a drop of a goddess's blood, which makes her a shield maiden with magic capable of repelling any attack. And it's been foretold that such magic will unite the fractured nation of Skaland beneath the one who controls the shield maiden's fate. <p/>Believing he's destined to rule Skaland as king, the fanatical jarl binds Freya with a blood oath and orders Bjorn to protect her from their enemies. Desperate to prove her strength, Freya must train to fight and learn to control her magic, all while facing perilous tests set by the gods. The greatest test of all, however, may be resisting her forbidden attraction to Bjorn. If Freya succumbs to her lust for the charming and fierce warrior, she risks not only her own destiny but the fate of all the people she has sworn to protect.",
        "rating": null
    },
    {
        "name": "A Little Life",
        "author": [
            "Hanya Yanagihara"
        ],
        "popularity rank": 48,
        "genres": [
            "sagas",
            "asian american",
            "literary",
            "coming of age"
        ],
        "description": "<b>NATIONAL BESTSELLER - A stunning \"portrait of the enduring grace of friendship\" (<i>NPR</i>) about the families we are born into, and those that we make for ourselves. A masterful depiction of love in the twenty-first century.<br></b><br><b><b><b><b><b><b><b>NATIONAL BOOK AWARD FINALIST <b><b><b>-</b></b></b></b> MAN BOOKER PRIZE FINALIST <b>- <b><b><b><b><b> WINNER OF THE KIRKUS PRIZE</b></b></b></b></b></b></b></b></b></b></b></b> <p/><i>A Little Life</i> follows four college classmates--broke, adrift, and buoyed only by their friendship and ambition--as they move to New York in search of fame and fortune. While their relationships, which are tinged by addiction, success, and pride, deepen over the decades, the men are held together by their devotion to the brilliant, enigmatic Jude, a man scarred by an unspeakable childhood trauma. A hymn to brotherly bonds and a masterful depiction of love in the twenty-first century, Hanya Yanagihara's stunning novel is about the families we are born into, and those that we make for ourselves. <p/><b>Look for Hanya Yanagihara's<i> </i>bestselling new novel, <i>To Paradise, </i>available now<i>.</i></b>",
        "rating": 7.9428572
    },
    {
        "name": "The Teacher",
        "author": [
            "Freida McFadden"
        ],
        "popularity rank": 49,
        "genres": [
            "thrillers",
            "psychological",
            "suspense"
        ],
        "description": "<p><strong>\"Superb...[<em>The Teacher</em>] rivets.\" <em>Publishers Weekly, </em> starred review</strong></p><p><strong>A mind-bending, psychological thriller from the <em>New York Times</em> and<em> USA Today</em> bestselling author of <em>The Housemaid</em>!</strong></p><p><strong>Lesson #1: trust no one</strong></p><p>Eve has a good life. She gets up each day, gets a kiss from her husband Nate, and heads off to teach math at the local high school. All is as it should be. Except...</p><p>Last year, Caseham High was rocked by a scandal, with one student, Addie, at its center. And this year, Eve is dismayed to find the girl in her class. </p><p>Addie can't be trusted. She lies. She hurts people. She destroys lives. At least, that's what everyone says. </p><p>But nobody knows the real Addie. Nobody knows the secrets that could destroy her. And Addie will do anything to keep it quiet.</p><p>From the <em>New York Times</em> bestselling author Freida McFadden comes a story of twisting secrets and long-awaited revenge.</p>",
        "rating": null
    },
    {
        "name": "The Age of Magical Overthinking: Notes on Modern Irrationality",
        "author": [
            "Amanda Montell"
        ],
        "popularity rank": 50,
        "genres": [
            "popular culture",
            "cognitive psychology & cognition",
            "personal memoirs"
        ],
        "description": "<b>From the bestselling author of <i>Cultish </i>and host of the podcast <i>Sounds Like a Cult</i>, a delicious blend of cultural criticism and personal narrative that explores our cognitive biases and the power, disadvantages, and highlights of magical thinking.</b> <p/>Utilizing the linguistic insights of her \"witty and brilliant\" (Blyth Roberson, author of <i>America the Beautiful?</i>) first book <i>Wordslut</i> and the sociological explorations of her breakout hit <i>Cultish</i>, Amanda Montell now turns her erudite eye to the inner workings of the human mind and its biases in her most personal and electrifying work yet. <p/> \"Magical thinking\" can be broadly defined as the belief that one's internal thoughts can affect unrelated events in the external world: Think of the conviction that one can manifest their way out of poverty, stave off cancer with positive vibes, thwart the apocalypse by learning to can their own peaches, or transform an unhealthy relationship to a glorious one with loyalty alone. In all its forms, magical thinking works in service of restoring agency amid chaos, but in <i>The Age of Magical Overthinking</i>, Montell argues that in the modern information age, our brain's coping mechanisms have been overloaded, and our irrationality turned up to an eleven. <p/> In a series of razor sharp, deeply funny chapters, Montell delves into a cornucopia of the cognitive biases that run rampant in our brains, from how the \"Halo effect\" cultivates worship (and hatred) of larger than life celebrities, to how the \"Sunk Cost Fallacy\" can keep us in detrimental relationships long after we've realized they're not serving us. As she illuminates these concepts with her signature brilliance and wit, Montell's prevailing message is one of hope, empathy, and ultimately forgiveness for our anxiety-addled human selves. If you have all but lost faith in our ability to reason, Montell aims to make some sense of the senseless. To crack open a window in our minds, and let a warm breeze in. To help quiet the cacophony for a while, or even hear a melody in it.",
        "rating": null
    }
]